// 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

for (let i = 20; i <= 30; i+=0.5) {
  console.log(i)
}
console.log('------------------------------')

// 2. Один долар коштує 38 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

const dollarPrice = 38;

for (let i = 10; i <= 100; i+=10) {
  console.log(i * dollarPrice)
}
console.log('------------------------------')

// 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

const numTask3 = 50;

for (let i = 1; i <= 100; i++) {
  if ((i * i) < numTask3) {
    console.log(`Число: ${i}, у квадраті ${i*i}, що меше за ${numTask3}`);
  }
}
console.log('------------------------------')

// 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

const numTask4 = 17;
let isPrime = true;

for (let i = 2; i <= numTask4 - 1; i++) {
  if (numTask4 % i === 0) {
    isPrime = false;
    break;
  }
} 

if (isPrime) {
  console.log(`Число ${numTask4} просте`);
} else {
  console.log(`Число ${numTask4} не є простим`);
}

console.log('------------------------------')

// 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

const numTask5 = 243;
let itPossible = false;

for (let i = 1; i <= numTask5; i++) {
  if (3**i === numTask5) {
    console.log(`Число ${numTask5} можна одержати зведенням числа 3 в ${i} степінь🎉`)
    itPossible = true;
    break;
  }
} 

if (!itPossible) {
  console.log(`Число ${numTask5} не можна одержати шляхом зведення числа 3 у деякий ступінь`);
} 

